# GridColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayDeformedShapeSettings..::..GridColor Property
AnalysisDisplayDeformedShapeSettings Class See Also
---
Color of grid lines.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Color GridColor { get; set; }
```

Visual Basic
---
```text
Public Property GridColor As Color
	Get
	Set
```

Visual C++
---
```text
public:
property Color^ GridColor {
	Color^ get ();
	void set (Color^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace